projeto-ror/app/controllers/v2/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
    def index
      @contacts = Contact.last(5)