projeto-ror/app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.all
---
SELECT "kinds".* FROM "kinds"

    def set_kind
      if params[:contact_id]
        @kind = Contact.find(params[:contact_id]).kind_id
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]